{"modelTopology":{"class_name":"Model","config":{"name":"MobilenetV3Large","layers":[{"name":"input1","class_name":"InputLayer","config":{"batch_input_shape":[null,98,112,3],"dtype":"float32","sparse":false,"name":"input1"},"inbound_nodes":[]},{"name":"Conv","class_name":"Conv2D","config":{"filters":16,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[3,3],"strides":[2,2],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"linear","use_bias":false,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"Conv","trainable":true},"inbound_nodes":[[["input1",0,0,{}]]]},{"name":"Conv-BatchNorm","class_name":"BatchNormalization","config":{"axis":-1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"Conv-BatchNorm","trainable":true},"inbound_nodes":[[["Conv",0,0,{}]]]},{"name":"Conv-HardSwish","class_name":null,"config":{"name":"Conv-HardSwish","trainable":true},"inbound_nodes":[[["Conv-BatchNorm",0,0,{}]]]},{"name":"expanded_conv-depthwise","class_name":"DepthwiseConv2D","config":{"kernel_size":[3,3],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"linear","use_bias":false,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"expanded_conv-depthwise","trainable":true,"depth_multiplier":1,"depthwise_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"depthwise_regularizer":null,"depthwise_constraint":null},"inbound_nodes":[[["Conv-HardSwish",0,0,{}]]]},{"name":"expanded_conv-depthwise-BatchNorm","class_name":"BatchNormalization","config":{"axis":-1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"expanded_conv-depthwise-BatchNorm","trainable":true},"inbound_nodes":[[["expanded_conv-depthwise",0,0,{}]]]},{"name":"expanded_conv-depthwise-Action2","class_name":null,"config":{"name":"expanded_conv-depthwise-Action2","trainable":true},"inbound_nodes":[[["expanded_conv-depthwise-BatchNorm",0,0,{}]]]},{"name":"expanded_conv-project","class_name":"Conv2D","config":{"filters":16,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[1,1],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"linear","use_bias":false,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"expanded_conv-project","trainable":true},"inbound_nodes":[[["expanded_conv-depthwise-Action2",0,0,{}]]]},{"name":"expanded_conv-project-BatchNorm","class_name":"BatchNormalization","config":{"axis":-1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"expanded_conv-project-BatchNorm","trainable":true},"inbound_nodes":[[["expanded_conv-project",0,0,{}]]]},{"name":"expanded_conv-Add","class_name":"Add","config":{"name":"expanded_conv-Add","trainable":true},"inbound_nodes":[[["expanded_conv-project-BatchNorm",0,0,{}],["Conv-HardSwish",0,0,{}]]]},{"name":"expanded_conv_1-expand","class_name":"Conv2D","config":{"filters":64,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"kernel_regularizer":{"class_name":"L1L2","config":{"l1":0,"l2":0.01}},"kernel_constraint":null,"kernel_size":[1,1],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"linear","use_bias":false,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"expanded_conv_1-expand","trainable":true},"inbound_nodes":[[["expanded_conv-Add",0,0,{}]]]},{"name":"expanded_conv_1-expand-BatchNorm","class_name":"BatchNormalization","config":{"axis":-1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"expanded_conv_1-expand-BatchNorm","trainable":true},"inbound_nodes":[[["expanded_conv_1-expand",0,0,{}]]]},{"name":"expanded_conv_1-depthwise-Action1","class_name":null,"config":{"name":"expanded_conv_1-depthwise-Action1","trainable":true},"inbound_nodes":[[["expanded_conv_1-expand-BatchNorm",0,0,{}]]]},{"name":"expanded_conv_1-depthwise-pad","class_name":"ZeroPadding2D","config":{"padding":[[1.5,1.5],[0.5,1.5]],"data_format":"channels_last","name":"expanded_conv_1-depthwise-pad","trainable":true},"inbound_nodes":[[["expanded_conv_1-depthwise-Action1",0,0,{}]]]},{"name":"expanded_conv_1-depthwise","class_name":"DepthwiseConv2D","config":{"kernel_size":[3,3],"strides":[2,2],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"linear","use_bias":false,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"expanded_conv_1-depthwise","trainable":true,"depth_multiplier":1,"depthwise_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"depthwise_regularizer":null,"depthwise_constraint":null},"inbound_nodes":[[["expanded_conv_1-depthwise-pad",0,0,{}]]]},{"name":"expanded_conv_1-depthwise-BatchNorm","class_name":"BatchNormalization","config":{"axis":-1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"expanded_conv_1-depthwise-BatchNorm","trainable":true},"inbound_nodes":[[["expanded_conv_1-depthwise",0,0,{}]]]},{"name":"expanded_conv_1-depthwise-Action2","class_name":null,"config":{"name":"expanded_conv_1-depthwise-Action2","trainable":true},"inbound_nodes":[[["expanded_conv_1-depthwise-BatchNorm",0,0,{}]]]},{"name":"expanded_conv_1-project","class_name":"Conv2D","config":{"filters":24,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[1,1],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"linear","use_bias":false,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"expanded_conv_1-project","trainable":true},"inbound_nodes":[[["expanded_conv_1-depthwise-Action2",0,0,{}]]]},{"name":"expanded_conv_1-project-BatchNorm","class_name":"BatchNormalization","config":{"axis":-1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"expanded_conv_1-project-BatchNorm","trainable":true},"inbound_nodes":[[["expanded_conv_1-project",0,0,{}]]]},{"name":"expanded_conv_2-expand","class_name":"Conv2D","config":{"filters":72,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"kernel_regularizer":{"class_name":"L1L2","config":{"l1":0,"l2":0.01}},"kernel_constraint":null,"kernel_size":[1,1],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"linear","use_bias":false,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"expanded_conv_2-expand","trainable":true},"inbound_nodes":[[["expanded_conv_1-project-BatchNorm",0,0,{}]]]},{"name":"expanded_conv_2-expand-BatchNorm","class_name":"BatchNormalization","config":{"axis":-1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"expanded_conv_2-expand-BatchNorm","trainable":true},"inbound_nodes":[[["expanded_conv_2-expand",0,0,{}]]]},{"name":"expanded_conv_2-depthwise-Action1","class_name":null,"config":{"name":"expanded_conv_2-depthwise-Action1","trainable":true},"inbound_nodes":[[["expanded_conv_2-expand-BatchNorm",0,0,{}]]]},{"name":"expanded_conv_2-depthwise","class_name":"DepthwiseConv2D","config":{"kernel_size":[3,3],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"linear","use_bias":false,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"expanded_conv_2-depthwise","trainable":true,"depth_multiplier":1,"depthwise_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"depthwise_regularizer":null,"depthwise_constraint":null},"inbound_nodes":[[["expanded_conv_2-depthwise-Action1",0,0,{}]]]},{"name":"expanded_conv_2-depthwise-BatchNorm","class_name":"BatchNormalization","config":{"axis":-1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"expanded_conv_2-depthwise-BatchNorm","trainable":true},"inbound_nodes":[[["expanded_conv_2-depthwise",0,0,{}]]]},{"name":"expanded_conv_2-depthwise-Action2","class_name":null,"config":{"name":"expanded_conv_2-depthwise-Action2","trainable":true},"inbound_nodes":[[["expanded_conv_2-depthwise-BatchNorm",0,0,{}]]]},{"name":"expanded_conv_2-project","class_name":"Conv2D","config":{"filters":24,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[1,1],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"linear","use_bias":false,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"expanded_conv_2-project","trainable":true},"inbound_nodes":[[["expanded_conv_2-depthwise-Action2",0,0,{}]]]},{"name":"expanded_conv_2-project-BatchNorm","class_name":"BatchNormalization","config":{"axis":-1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"expanded_conv_2-project-BatchNorm","trainable":true},"inbound_nodes":[[["expanded_conv_2-project",0,0,{}]]]},{"name":"expanded_conv_2-Add","class_name":"Add","config":{"name":"expanded_conv_2-Add","trainable":true},"inbound_nodes":[[["expanded_conv_2-project-BatchNorm",0,0,{}],["expanded_conv_1-project-BatchNorm",0,0,{}]]]},{"name":"expanded_conv_3-expand","class_name":"Conv2D","config":{"filters":72,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"kernel_regularizer":{"class_name":"L1L2","config":{"l1":0,"l2":0.01}},"kernel_constraint":null,"kernel_size":[1,1],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"linear","use_bias":false,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"expanded_conv_3-expand","trainable":true},"inbound_nodes":[[["expanded_conv_2-Add",0,0,{}]]]},{"name":"expanded_conv_3-expand-BatchNorm","class_name":"BatchNormalization","config":{"axis":-1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"expanded_conv_3-expand-BatchNorm","trainable":true},"inbound_nodes":[[["expanded_conv_3-expand",0,0,{}]]]},{"name":"expanded_conv_3-depthwise-Action1","class_name":null,"config":{"name":"expanded_conv_3-depthwise-Action1","trainable":true},"inbound_nodes":[[["expanded_conv_3-expand-BatchNorm",0,0,{}]]]},{"name":"expanded_conv_3-depthwise-pad","class_name":"ZeroPadding2D","config":{"padding":[[1.5,2.5],[2.5,2.5]],"data_format":"channels_last","name":"expanded_conv_3-depthwise-pad","trainable":true},"inbound_nodes":[[["expanded_conv_3-depthwise-Action1",0,0,{}]]]},{"name":"expanded_conv_3-depthwise","class_name":"DepthwiseConv2D","config":{"kernel_size":[5,5],"strides":[2,2],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"linear","use_bias":false,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"expanded_conv_3-depthwise","trainable":true,"depth_multiplier":1,"depthwise_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"depthwise_regularizer":null,"depthwise_constraint":null},"inbound_nodes":[[["expanded_conv_3-depthwise-pad",0,0,{}]]]},{"name":"expanded_conv_3-depthwise-BatchNorm","class_name":"BatchNormalization","config":{"axis":-1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"expanded_conv_3-depthwise-BatchNorm","trainable":true},"inbound_nodes":[[["expanded_conv_3-depthwise",0,0,{}]]]},{"name":"expanded_conv_3-depthwise-Action2","class_name":null,"config":{"name":"expanded_conv_3-depthwise-Action2","trainable":true},"inbound_nodes":[[["expanded_conv_3-depthwise-BatchNorm",0,0,{}]]]},{"name":"expanded_conv_3-squeeze_excite-AvgPool","class_name":"GlobalAveragePooling2D","config":{"data_format":"channels_last","name":"expanded_conv_3-squeeze_excite-AvgPool","trainable":true},"inbound_nodes":[[["expanded_conv_3-depthwise-Action2",0,0,{}]]]},{"name":"reshape_Reshape1","class_name":"Reshape","config":{"target_shape":[1,1,72],"name":"reshape_Reshape1","trainable":true},"inbound_nodes":[[["expanded_conv_3-squeeze_excite-AvgPool",0,0,{}]]]},{"name":"expanded_conv_3-squeeze_excite-Conv","class_name":"Conv2D","config":{"filters":24,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[1,1],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"linear","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"expanded_conv_3-squeeze_excite-Conv","trainable":true},"inbound_nodes":[[["reshape_Reshape1",0,0,{}]]]},{"name":"expanded_conv_3-squeeze_excite-Relu","class_name":"ReLU","config":{"max_value":null,"name":"expanded_conv_3-squeeze_excite-Relu","trainable":true},"inbound_nodes":[[["expanded_conv_3-squeeze_excite-Conv",0,0,{}]]]},{"name":"expanded_conv_3-squeeze_excite-Conv_1","class_name":"Conv2D","config":{"filters":72,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[1,1],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"linear","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"expanded_conv_3-squeeze_excite-Conv_1","trainable":true},"inbound_nodes":[[["expanded_conv_3-squeeze_excite-Relu",0,0,{}]]]},{"name":"expanded_conv_3-squeeze_excite-HardSigmoid","class_name":null,"config":{"name":"expanded_conv_3-squeeze_excite-HardSigmoid","trainable":true},"inbound_nodes":[[["expanded_conv_3-squeeze_excite-Conv_1",0,0,{}]]]},{"name":"expanded_conv_3-squeeze_excite-Mul","class_name":"Multiply","config":{"name":"expanded_conv_3-squeeze_excite-Mul","trainable":true},"inbound_nodes":[[["expanded_conv_3-depthwise-Action2",0,0,{}],["expanded_conv_3-squeeze_excite-HardSigmoid",0,0,{}]]]},{"name":"expanded_conv_3-project","class_name":"Conv2D","config":{"filters":40,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[1,1],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"linear","use_bias":false,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"expanded_conv_3-project","trainable":true},"inbound_nodes":[[["expanded_conv_3-squeeze_excite-Mul",0,0,{}]]]},{"name":"expanded_conv_3-project-BatchNorm","class_name":"BatchNormalization","config":{"axis":-1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"expanded_conv_3-project-BatchNorm","trainable":true},"inbound_nodes":[[["expanded_conv_3-project",0,0,{}]]]},{"name":"expanded_conv_4-expand","class_name":"Conv2D","config":{"filters":120,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"kernel_regularizer":{"class_name":"L1L2","config":{"l1":0,"l2":0.01}},"kernel_constraint":null,"kernel_size":[1,1],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"linear","use_bias":false,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"expanded_conv_4-expand","trainable":true},"inbound_nodes":[[["expanded_conv_3-project-BatchNorm",0,0,{}]]]},{"name":"expanded_conv_4-expand-BatchNorm","class_name":"BatchNormalization","config":{"axis":-1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"expanded_conv_4-expand-BatchNorm","trainable":true},"inbound_nodes":[[["expanded_conv_4-expand",0,0,{}]]]},{"name":"expanded_conv_4-depthwise-Action1","class_name":null,"config":{"name":"expanded_conv_4-depthwise-Action1","trainable":true},"inbound_nodes":[[["expanded_conv_4-expand-BatchNorm",0,0,{}]]]},{"name":"expanded_conv_4-depthwise","class_name":"DepthwiseConv2D","config":{"kernel_size":[5,5],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"linear","use_bias":false,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"expanded_conv_4-depthwise","trainable":true,"depth_multiplier":1,"depthwise_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"depthwise_regularizer":null,"depthwise_constraint":null},"inbound_nodes":[[["expanded_conv_4-depthwise-Action1",0,0,{}]]]},{"name":"expanded_conv_4-depthwise-BatchNorm","class_name":"BatchNormalization","config":{"axis":-1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"expanded_conv_4-depthwise-BatchNorm","trainable":true},"inbound_nodes":[[["expanded_conv_4-depthwise",0,0,{}]]]},{"name":"expanded_conv_4-depthwise-Action2","class_name":null,"config":{"name":"expanded_conv_4-depthwise-Action2","trainable":true},"inbound_nodes":[[["expanded_conv_4-depthwise-BatchNorm",0,0,{}]]]},{"name":"expanded_conv_4-squeeze_excite-AvgPool","class_name":"GlobalAveragePooling2D","config":{"data_format":"channels_last","name":"expanded_conv_4-squeeze_excite-AvgPool","trainable":true},"inbound_nodes":[[["expanded_conv_4-depthwise-Action2",0,0,{}]]]},{"name":"reshape_Reshape2","class_name":"Reshape","config":{"target_shape":[1,1,120],"name":"reshape_Reshape2","trainable":true},"inbound_nodes":[[["expanded_conv_4-squeeze_excite-AvgPool",0,0,{}]]]},{"name":"expanded_conv_4-squeeze_excite-Conv","class_name":"Conv2D","config":{"filters":32,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[1,1],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"linear","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"expanded_conv_4-squeeze_excite-Conv","trainable":true},"inbound_nodes":[[["reshape_Reshape2",0,0,{}]]]},{"name":"expanded_conv_4-squeeze_excite-Relu","class_name":"ReLU","config":{"max_value":null,"name":"expanded_conv_4-squeeze_excite-Relu","trainable":true},"inbound_nodes":[[["expanded_conv_4-squeeze_excite-Conv",0,0,{}]]]},{"name":"expanded_conv_4-squeeze_excite-Conv_1","class_name":"Conv2D","config":{"filters":120,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[1,1],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"linear","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"expanded_conv_4-squeeze_excite-Conv_1","trainable":true},"inbound_nodes":[[["expanded_conv_4-squeeze_excite-Relu",0,0,{}]]]},{"name":"expanded_conv_4-squeeze_excite-HardSigmoid","class_name":null,"config":{"name":"expanded_conv_4-squeeze_excite-HardSigmoid","trainable":true},"inbound_nodes":[[["expanded_conv_4-squeeze_excite-Conv_1",0,0,{}]]]},{"name":"expanded_conv_4-squeeze_excite-Mul","class_name":"Multiply","config":{"name":"expanded_conv_4-squeeze_excite-Mul","trainable":true},"inbound_nodes":[[["expanded_conv_4-depthwise-Action2",0,0,{}],["expanded_conv_4-squeeze_excite-HardSigmoid",0,0,{}]]]},{"name":"expanded_conv_4-project","class_name":"Conv2D","config":{"filters":40,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[1,1],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"linear","use_bias":false,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"expanded_conv_4-project","trainable":true},"inbound_nodes":[[["expanded_conv_4-squeeze_excite-Mul",0,0,{}]]]},{"name":"expanded_conv_4-project-BatchNorm","class_name":"BatchNormalization","config":{"axis":-1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"expanded_conv_4-project-BatchNorm","trainable":true},"inbound_nodes":[[["expanded_conv_4-project",0,0,{}]]]},{"name":"expanded_conv_4-Add","class_name":"Add","config":{"name":"expanded_conv_4-Add","trainable":true},"inbound_nodes":[[["expanded_conv_4-project-BatchNorm",0,0,{}],["expanded_conv_3-project-BatchNorm",0,0,{}]]]},{"name":"expanded_conv_5-expand","class_name":"Conv2D","config":{"filters":120,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"kernel_regularizer":{"class_name":"L1L2","config":{"l1":0,"l2":0.01}},"kernel_constraint":null,"kernel_size":[1,1],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"linear","use_bias":false,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"expanded_conv_5-expand","trainable":true},"inbound_nodes":[[["expanded_conv_4-Add",0,0,{}]]]},{"name":"expanded_conv_5-expand-BatchNorm","class_name":"BatchNormalization","config":{"axis":-1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"expanded_conv_5-expand-BatchNorm","trainable":true},"inbound_nodes":[[["expanded_conv_5-expand",0,0,{}]]]},{"name":"expanded_conv_5-depthwise-Action1","class_name":null,"config":{"name":"expanded_conv_5-depthwise-Action1","trainable":true},"inbound_nodes":[[["expanded_conv_5-expand-BatchNorm",0,0,{}]]]},{"name":"expanded_conv_5-depthwise","class_name":"DepthwiseConv2D","config":{"kernel_size":[5,5],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"linear","use_bias":false,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"expanded_conv_5-depthwise","trainable":true,"depth_multiplier":1,"depthwise_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"depthwise_regularizer":null,"depthwise_constraint":null},"inbound_nodes":[[["expanded_conv_5-depthwise-Action1",0,0,{}]]]},{"name":"expanded_conv_5-depthwise-BatchNorm","class_name":"BatchNormalization","config":{"axis":-1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"expanded_conv_5-depthwise-BatchNorm","trainable":true},"inbound_nodes":[[["expanded_conv_5-depthwise",0,0,{}]]]},{"name":"expanded_conv_5-depthwise-Action2","class_name":null,"config":{"name":"expanded_conv_5-depthwise-Action2","trainable":true},"inbound_nodes":[[["expanded_conv_5-depthwise-BatchNorm",0,0,{}]]]},{"name":"expanded_conv_5-squeeze_excite-AvgPool","class_name":"GlobalAveragePooling2D","config":{"data_format":"channels_last","name":"expanded_conv_5-squeeze_excite-AvgPool","trainable":true},"inbound_nodes":[[["expanded_conv_5-depthwise-Action2",0,0,{}]]]},{"name":"reshape_Reshape3","class_name":"Reshape","config":{"target_shape":[1,1,120],"name":"reshape_Reshape3","trainable":true},"inbound_nodes":[[["expanded_conv_5-squeeze_excite-AvgPool",0,0,{}]]]},{"name":"expanded_conv_5-squeeze_excite-Conv","class_name":"Conv2D","config":{"filters":32,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[1,1],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"linear","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"expanded_conv_5-squeeze_excite-Conv","trainable":true},"inbound_nodes":[[["reshape_Reshape3",0,0,{}]]]},{"name":"expanded_conv_5-squeeze_excite-Relu","class_name":"ReLU","config":{"max_value":null,"name":"expanded_conv_5-squeeze_excite-Relu","trainable":true},"inbound_nodes":[[["expanded_conv_5-squeeze_excite-Conv",0,0,{}]]]},{"name":"expanded_conv_5-squeeze_excite-Conv_1","class_name":"Conv2D","config":{"filters":120,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[1,1],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"linear","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"expanded_conv_5-squeeze_excite-Conv_1","trainable":true},"inbound_nodes":[[["expanded_conv_5-squeeze_excite-Relu",0,0,{}]]]},{"name":"expanded_conv_5-squeeze_excite-HardSigmoid","class_name":null,"config":{"name":"expanded_conv_5-squeeze_excite-HardSigmoid","trainable":true},"inbound_nodes":[[["expanded_conv_5-squeeze_excite-Conv_1",0,0,{}]]]},{"name":"expanded_conv_5-squeeze_excite-Mul","class_name":"Multiply","config":{"name":"expanded_conv_5-squeeze_excite-Mul","trainable":true},"inbound_nodes":[[["expanded_conv_5-depthwise-Action2",0,0,{}],["expanded_conv_5-squeeze_excite-HardSigmoid",0,0,{}]]]},{"name":"expanded_conv_5-project","class_name":"Conv2D","config":{"filters":40,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[1,1],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"linear","use_bias":false,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"expanded_conv_5-project","trainable":true},"inbound_nodes":[[["expanded_conv_5-squeeze_excite-Mul",0,0,{}]]]},{"name":"expanded_conv_5-project-BatchNorm","class_name":"BatchNormalization","config":{"axis":-1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"expanded_conv_5-project-BatchNorm","trainable":true},"inbound_nodes":[[["expanded_conv_5-project",0,0,{}]]]},{"name":"expanded_conv_5-Add","class_name":"Add","config":{"name":"expanded_conv_5-Add","trainable":true},"inbound_nodes":[[["expanded_conv_5-project-BatchNorm",0,0,{}],["expanded_conv_4-Add",0,0,{}]]]},{"name":"expanded_conv_6-expand","class_name":"Conv2D","config":{"filters":240,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"kernel_regularizer":{"class_name":"L1L2","config":{"l1":0,"l2":0.01}},"kernel_constraint":null,"kernel_size":[1,1],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"linear","use_bias":false,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"expanded_conv_6-expand","trainable":true},"inbound_nodes":[[["expanded_conv_5-Add",0,0,{}]]]},{"name":"expanded_conv_6-expand-BatchNorm","class_name":"BatchNormalization","config":{"axis":-1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"expanded_conv_6-expand-BatchNorm","trainable":true},"inbound_nodes":[[["expanded_conv_6-expand",0,0,{}]]]},{"name":"expanded_conv_6-depthwise-Action1","class_name":null,"config":{"name":"expanded_conv_6-depthwise-Action1","trainable":true},"inbound_nodes":[[["expanded_conv_6-expand-BatchNorm",0,0,{}]]]},{"name":"expanded_conv_6-depthwise-pad","class_name":"ZeroPadding2D","config":{"padding":[[1.5,1.5],[1.5,1.5]],"data_format":"channels_last","name":"expanded_conv_6-depthwise-pad","trainable":true},"inbound_nodes":[[["expanded_conv_6-depthwise-Action1",0,0,{}]]]},{"name":"expanded_conv_6-depthwise","class_name":"DepthwiseConv2D","config":{"kernel_size":[3,3],"strides":[2,2],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"linear","use_bias":false,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"expanded_conv_6-depthwise","trainable":true,"depth_multiplier":1,"depthwise_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"depthwise_regularizer":null,"depthwise_constraint":null},"inbound_nodes":[[["expanded_conv_6-depthwise-pad",0,0,{}]]]},{"name":"expanded_conv_6-depthwise-BatchNorm","class_name":"BatchNormalization","config":{"axis":-1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"expanded_conv_6-depthwise-BatchNorm","trainable":true},"inbound_nodes":[[["expanded_conv_6-depthwise",0,0,{}]]]},{"name":"expanded_conv_6-depthwise-Action2","class_name":null,"config":{"name":"expanded_conv_6-depthwise-Action2","trainable":true},"inbound_nodes":[[["expanded_conv_6-depthwise-BatchNorm",0,0,{}]]]},{"name":"expanded_conv_6-project","class_name":"Conv2D","config":{"filters":80,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[1,1],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"linear","use_bias":false,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"expanded_conv_6-project","trainable":true},"inbound_nodes":[[["expanded_conv_6-depthwise-Action2",0,0,{}]]]},{"name":"expanded_conv_6-project-BatchNorm","class_name":"BatchNormalization","config":{"axis":-1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"expanded_conv_6-project-BatchNorm","trainable":true},"inbound_nodes":[[["expanded_conv_6-project",0,0,{}]]]},{"name":"expanded_conv_7-expand","class_name":"Conv2D","config":{"filters":200,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"kernel_regularizer":{"class_name":"L1L2","config":{"l1":0,"l2":0.01}},"kernel_constraint":null,"kernel_size":[1,1],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"linear","use_bias":false,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"expanded_conv_7-expand","trainable":true},"inbound_nodes":[[["expanded_conv_6-project-BatchNorm",0,0,{}]]]},{"name":"expanded_conv_7-expand-BatchNorm","class_name":"BatchNormalization","config":{"axis":-1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"expanded_conv_7-expand-BatchNorm","trainable":true},"inbound_nodes":[[["expanded_conv_7-expand",0,0,{}]]]},{"name":"expanded_conv_7-depthwise-Action1","class_name":null,"config":{"name":"expanded_conv_7-depthwise-Action1","trainable":true},"inbound_nodes":[[["expanded_conv_7-expand-BatchNorm",0,0,{}]]]},{"name":"expanded_conv_7-depthwise","class_name":"DepthwiseConv2D","config":{"kernel_size":[3,3],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"linear","use_bias":false,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"expanded_conv_7-depthwise","trainable":true,"depth_multiplier":1,"depthwise_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"depthwise_regularizer":null,"depthwise_constraint":null},"inbound_nodes":[[["expanded_conv_7-depthwise-Action1",0,0,{}]]]},{"name":"expanded_conv_7-depthwise-BatchNorm","class_name":"BatchNormalization","config":{"axis":-1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"expanded_conv_7-depthwise-BatchNorm","trainable":true},"inbound_nodes":[[["expanded_conv_7-depthwise",0,0,{}]]]},{"name":"expanded_conv_7-depthwise-Action2","class_name":null,"config":{"name":"expanded_conv_7-depthwise-Action2","trainable":true},"inbound_nodes":[[["expanded_conv_7-depthwise-BatchNorm",0,0,{}]]]},{"name":"expanded_conv_7-project","class_name":"Conv2D","config":{"filters":80,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[1,1],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"linear","use_bias":false,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"expanded_conv_7-project","trainable":true},"inbound_nodes":[[["expanded_conv_7-depthwise-Action2",0,0,{}]]]},{"name":"expanded_conv_7-project-BatchNorm","class_name":"BatchNormalization","config":{"axis":-1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"expanded_conv_7-project-BatchNorm","trainable":true},"inbound_nodes":[[["expanded_conv_7-project",0,0,{}]]]},{"name":"expanded_conv_7-Add","class_name":"Add","config":{"name":"expanded_conv_7-Add","trainable":true},"inbound_nodes":[[["expanded_conv_7-project-BatchNorm",0,0,{}],["expanded_conv_6-project-BatchNorm",0,0,{}]]]},{"name":"expanded_conv_8-expand","class_name":"Conv2D","config":{"filters":184,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"kernel_regularizer":{"class_name":"L1L2","config":{"l1":0,"l2":0.01}},"kernel_constraint":null,"kernel_size":[1,1],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"linear","use_bias":false,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"expanded_conv_8-expand","trainable":true},"inbound_nodes":[[["expanded_conv_7-Add",0,0,{}]]]},{"name":"expanded_conv_8-expand-BatchNorm","class_name":"BatchNormalization","config":{"axis":-1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"expanded_conv_8-expand-BatchNorm","trainable":true},"inbound_nodes":[[["expanded_conv_8-expand",0,0,{}]]]},{"name":"expanded_conv_8-depthwise-Action1","class_name":null,"config":{"name":"expanded_conv_8-depthwise-Action1","trainable":true},"inbound_nodes":[[["expanded_conv_8-expand-BatchNorm",0,0,{}]]]},{"name":"expanded_conv_8-depthwise","class_name":"DepthwiseConv2D","config":{"kernel_size":[3,3],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"linear","use_bias":false,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"expanded_conv_8-depthwise","trainable":true,"depth_multiplier":1,"depthwise_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"depthwise_regularizer":null,"depthwise_constraint":null},"inbound_nodes":[[["expanded_conv_8-depthwise-Action1",0,0,{}]]]},{"name":"expanded_conv_8-depthwise-BatchNorm","class_name":"BatchNormalization","config":{"axis":-1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"expanded_conv_8-depthwise-BatchNorm","trainable":true},"inbound_nodes":[[["expanded_conv_8-depthwise",0,0,{}]]]},{"name":"expanded_conv_8-depthwise-Action2","class_name":null,"config":{"name":"expanded_conv_8-depthwise-Action2","trainable":true},"inbound_nodes":[[["expanded_conv_8-depthwise-BatchNorm",0,0,{}]]]},{"name":"expanded_conv_8-project","class_name":"Conv2D","config":{"filters":80,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[1,1],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"linear","use_bias":false,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"expanded_conv_8-project","trainable":true},"inbound_nodes":[[["expanded_conv_8-depthwise-Action2",0,0,{}]]]},{"name":"expanded_conv_8-project-BatchNorm","class_name":"BatchNormalization","config":{"axis":-1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"expanded_conv_8-project-BatchNorm","trainable":true},"inbound_nodes":[[["expanded_conv_8-project",0,0,{}]]]},{"name":"expanded_conv_8-Add","class_name":"Add","config":{"name":"expanded_conv_8-Add","trainable":true},"inbound_nodes":[[["expanded_conv_8-project-BatchNorm",0,0,{}],["expanded_conv_7-Add",0,0,{}]]]},{"name":"expanded_conv_9-expand","class_name":"Conv2D","config":{"filters":184,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"kernel_regularizer":{"class_name":"L1L2","config":{"l1":0,"l2":0.01}},"kernel_constraint":null,"kernel_size":[1,1],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"linear","use_bias":false,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"expanded_conv_9-expand","trainable":true},"inbound_nodes":[[["expanded_conv_8-Add",0,0,{}]]]},{"name":"expanded_conv_9-expand-BatchNorm","class_name":"BatchNormalization","config":{"axis":-1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"expanded_conv_9-expand-BatchNorm","trainable":true},"inbound_nodes":[[["expanded_conv_9-expand",0,0,{}]]]},{"name":"expanded_conv_9-depthwise-Action1","class_name":null,"config":{"name":"expanded_conv_9-depthwise-Action1","trainable":true},"inbound_nodes":[[["expanded_conv_9-expand-BatchNorm",0,0,{}]]]},{"name":"expanded_conv_9-depthwise","class_name":"DepthwiseConv2D","config":{"kernel_size":[3,3],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"linear","use_bias":false,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"expanded_conv_9-depthwise","trainable":true,"depth_multiplier":1,"depthwise_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"depthwise_regularizer":null,"depthwise_constraint":null},"inbound_nodes":[[["expanded_conv_9-depthwise-Action1",0,0,{}]]]},{"name":"expanded_conv_9-depthwise-BatchNorm","class_name":"BatchNormalization","config":{"axis":-1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},